print("=======================================")
#Задача а)
distance = 10
for i in range(10):
	print(i + 1, "day" ,round(distance,3), "km")
	distance = distance + distance/10
print("=======================================")

#Задача б)
c = 10
b = 0
for i in range(7):
    b += c
    c += c/10   
print("За первые 7 дней : ",b)
print("=======================================")

#Задача в)
c = 10
b = 0
n = int(input("кол-во дней: "))
for i in range(n):
    b += c
    c += c/10   
print("за n дней: ",b)
print("=======================================")

#г условие
a=10.0
n=0
while a<=80:
    n+=1
    a+=a/10   
print("На",n,"день конец ") 
print("=======================================")